const todayStatus = [
  {
    "task": "准备考试",
    "start_time": "2025-05-17T08:00:00",
    "end_time": "2025-05-17T08:45:00"
  },
  {
    "task": "写论文",
    "start_time": "2025-05-17T08:45:00",
    "end_time": "2025-05-17T09:30:00"
  },
  {
    "task": "申请博士",
    "start_time": "2025-05-17T09:30:00",
    "end_time": "2025-05-17T10:15:00"
  },
  {
    "task": "毕业设计",
    "start_time": "2025-05-17T10:15:00",
    "end_time": "2025-05-17T11:00:00"
  },
  {
    "task": "找工作",
    "start_time": "2025-05-17T11:00:00",
    "end_time": "2025-05-17T11:45:00"
  },
  {
    "task": "更新简历",
    "start_time": "2025-05-17T14:00:00",
    "end_time": "2025-05-17T14:45:00"
  },
  {
    "task": "整理电脑",
    "start_time": "2025-05-17T14:45:00",
    "end_time": "2025-05-17T15:30:00"
  },
  {
    "task": "查收邮件",
    "start_time": "2025-05-17T15:30:00",
    "end_time": "2025-05-17T16:15:00"
  },
  {
    "task": "联系家人",
    "start_time": "2025-05-17T16:15:00",
    "end_time": "2025-05-17T17:00:00"
  },
  {
    "task": "背单词",
    "start_time": "2025-05-17T17:00:00",
    "end_time": "2025-05-17T17:45:00"
  },
  {
    "task": "练口语",
    "start_time": "2025-05-17T20:00:00",
    "end_time": "2025-05-17T20:45:00"
  },
  {
    "task": "股票观察",
    "start_time": "2025-05-17T20:45:00",
    "end_time": "2025-05-17T21:30:00"
  }
];